app/views/fooddrinks/_form.html.erb

SELECT `categories`.* FROM `categories`
---
    <%= f.label :category_id %><br />
    <%= f.select :category_id, options_for_select(Category.all.collect{|c| [c.cateName, c.id]}) %>

SELECT `restaurants`.* FROM `restaurants`
---
    <%= f.label :restaurant_id %><br />
    <%= f.select :restaurant_id, options_for_select(Restaurant.all.collect{|r| [r.restName, r.id]}) %>