app/views/restaurants/_form.html.erb

SELECT `districts`.* FROM `districts`
---
    <%= f.label :district_id %><br />
    <%= f.select :district_id, options_for_select(District.all.collect{|d| [d.districtName, d.id]}) %>