app/controllers/fooddrinks_controller.rb

  def index
    @fooddrinks = Fooddrink.all
---
SELECT `fooddrinks`.* FROM `fooddrinks`

  def show
    @fooddrink = Fooddrink.find(params[:id])
---
SELECT `fooddrinks`.* FROM `fooddrinks` WHERE `fooddrinks`.`id` = 1 LIMIT 1

  def edit
    @fooddrink = Fooddrink.find(params[:id])
---
SELECT `fooddrinks`.* FROM `fooddrinks` WHERE `fooddrinks`.`id` = 1 LIMIT 1

  def create
    @fooddrink = Fooddrink.new(params[:fooddrink])

    respond_to do |format|
      if @fooddrink.save
---
INSERT INTO `fooddrinks` (`Price`, `Type`, `category_id`, `created_at`, `dateUpload`, `fdImage`, `fdName`, `rateNumber`, `restaurant_id`, `updated_at`) VALUES (400000, 1, 1, '2013-09-24 08:14:37', '2013-09-24', 'dsrfsdf', '1', 2.8, 1, '2013-09-24 08:14:37')

  def update
    @fooddrink = Fooddrink.find(params[:id])

    respond_to do |format|
      if @fooddrink.update_attributes(params[:fooddrink])
---
SELECT `fooddrinks`.* FROM `fooddrinks` WHERE `fooddrinks`.`id` = 1 LIMIT 1
UPDATE `fooddrinks` SET `fdName` = 'Gỏi ngó sen', `updated_at` = '2013-09-24 09:53:45' WHERE `fooddrinks`.`id` = 1